# Core tooling
brew "chezmoi"
brew "dockutil"
brew "git"
brew "gh"
brew "jq"
brew "mas"
brew "mise"
brew "uv"

# Shell
brew "antidote"
brew "oh-my-posh"
brew "zoxide"

# AI coding agents
cask "codex"

# Security
cask "1password"
cask "1password-cli"

# Daily tools
cask "chatgpt"
cask "claude"
cask "clockify"
cask "cursor"
cask "finicky"
cask "font-meslo-lg-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "google-drive"
cask "iina"
cask "mimestream"
cask "obsidian"
cask "raycast"
cask "slack"
cask "whatsapp"
cask "zen"

# Mac App Store
mas "Keynote", id: 361285480
mas "Numbers", id: 361304891
mas "Pages", id: 361309726
mas "Super Agent", id: 1568262835
mas "1Password for Safari", id: 1569813296
mas "GCal for Google Calendar", id: 1107163858
