tap "homebrew/cask-versions"
tap "homebrew/command-not-found"

# Programming language prerequisites and package managers
brew "git"
brew "volta"

# Shell tools
brew "antigen"

# Terminal
cask "iterm2"

# Dev tools
cask "docker"
cask "tableplus"
cask "visual-studio-code"

# Browsers
cask "google-chrome"
cask "firefox-developer-edition"

# Productivity
cask "google-drive-file-stream"
cask "1password"
brew "dockutil"
cask "notion"
# mas 'Keynote', id: 409183694
# mas 'Numbers', id: 409203825
# mas "Pages", id: 409201541

# Utils
cask "keka"
cask "kekaexternalhelper"

# Communication
cask "slack"

# Time Tracking
# cask "clockify"

# Music
cask "spotify"

# Video
cask "iina"